# 6，合并两个有序数组
#
# 题目形式：给定两个按升序排列的有序数组，将它们合并成一个新的有序数组。例如：a = [1,2,6,8], b = [2,4,7,10]，输出为 arr = [1,2,2,4,6,7,8,10]
# 题目难度：简单。
# 出现概率：约15%。这道题目考察的是归并排序的基本思想。注意，这两个数组是有序的呢，你怎么可以无视这么有利的条件直接拼接上两个数组开始冒泡了？？？


def m(a, b):
    c = []
    i = 0
    j = 0
    la = len(a)
    lb = len(b)

    while True:
        if i == la:
            return c + b[j:]
        elif j == lb:
            return c + a[i:]
        if a[i] < b[j]:
            c.append(a[i])
            i += 1
        else:
            c.append(b[j])
            j += 1


if __name__ == '__main__':
    a = [1, 2, 6, 8]
    b = [2, 4, 7, 10]
    print(m(a, b))
